Revit 2027 API
MacroModule.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<Macro> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of Macro)
public:
virtual IEnumerator<Macro^>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<Macro>
override GetEnumerator : unit -> IEnumerator<Macro>
Return Value
IEnumerator<Macro>
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
MacroModule Class
Autodesk.Revit.DB.Macros Namespace